In [14]:
import pandas as pd 
series  = pd.Series([10,20,30,40,50])
print(series)

0    10
1    20
2    30
3    40
4    50
dtype: int64

In [16]:
data = {"Name" : ['Alice', 'bob', 'Charlie'],
        'Age' : [25,30,35],
        'city':['new york','los angeles','chicago']}
df = pd.DataFrame(data)
print(df)

      Name  Age         city
0    Alice   25     new york
1      bob   30  los angeles
2  Charlie   35      chicago

In [18]:
df.head()

      Name  Age         city
0    Alice   25     new york
1      bob   30  los angeles
2  Charlie   35      chicago

In [20]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    3 non-null      object
 1   Age     3 non-null      int64
 2   city    3 non-null      object
dtypes: int64(1), object(2)
memory usage: 204.0+ bytes

In [22]:
df.describe()

        Age
count   3.0
mean   30.0
std     5.0
min    25.0
25%    27.5
50%    30.0
75%    32.5
max    35.0

In [26]:
df['Name']

0      Alice
1        bob
2    Charlie
Name: Name, dtype: object

In [34]:
filtered_df = df[df['Age'] > 30]
filtered_df

      Name  Age     city
2  Charlie   35  chicago

In [52]:
selected_data = df.loc[0:1, ['Name', 'city]]
selected_data

SyntaxError: unterminated string literal (detected at line 1) (2577171644.py, line 1)

In [54]:
df['Salary'] = [70000,80000,90000]
df

      Name  Age         city  Salary
0    Alice   25     new york   70000
1      bob   30  los angeles   80000
2  Charlie   35      chicago   90000

In [58]:
df['Age']+1

0    26
1    31
2    36
Name: Age, dtype: int64

In [62]:
df=df.drop('city',axis=1)
df

      Name  Age  Salary
0    Alice   25   70000
1      bob   30   80000
2  Charlie   35   90000

In [70]:
df_with_nan = pd.DataFrame({'A':[1,2,None],'B':[4,None,6]})
print(df_with_nan.isnull())

       A      B
0  False  False
1  False   True
2   True  False

In [72]:
df_with_nan

     A    B
0  1.0  4.0
1  2.0  NaN
2  NaN  6.0

In [74]:
df_with_nan.isnull()

       A      B
0  False  False
1  False   True
2   True  False

In [76]:
filled_df = df_with_nan.fillna(0)
filled_df

     A    B
0  1.0  4.0
1  2.0  0.0
2  0.0  6.0

In [80]:
cleaned_df = df_with_nan.dropna()
cleaned_df

     A    B
0  1.0  4.0

In [91]:
def double_salary(x):
    return x*2
df['Double Salary'] = df['Salary'].apply(double_salary)
df

      Name  Age  Salary  Double Salary
0    Alice   25   70000         140000
1      bob   30   80000         160000
2  Charlie   35   90000         180000

In [99]:
df = pd.DataFrame({"Department":['HR', 'IT','HR','IT'],
                   'Salary':[50000,60000,450000,80000]})
grouped = df.groupby('Department').mean()
print(grouped)

              Salary
Department
HR          250000.0
IT           70000.0

In [105]:
df_grades = pd.read_csv("Grades_Short.csv")
df_grades

,Name,Previous_Part,Participation1,Mini_Exam1,Mini_Exam2,Participation2,Mini_Exam3,Final,Grade,ID
0,Jake,32.0,1,19.5,20,1,10.0,33.0,A,90743
1,Joe,32.0,1,20.0,16,1,14.0,32.0,A,7284
2,Susan,30.0,1,19.0,19,1,10.5,33.0,A-,7625
3,Sol,31.0,1,22.0,13,1,13.0,34.0,A,1237
4,Chris,30.0,1,19.0,17,1,12.5,33.5,A,62
5,Tarik,31.0,1,19.0,19,1,8.0,24.0,B,87452
6,Malik,31.5,1,20.0,21,1,9.0,36.0,A,9374

In [103]:
df_grades.shape

(7, 10)

In [107]:
df_grades.dtypes

Name               object
Previous_Part     float64
Participation1      int64
Mini_Exam1        float64
Mini_Exam2          int64
Participation2      int64
Mini_Exam3        float64
Final             float64
Grade              object
ID                  int64
dtype: object

In [111]:
df_grades.columns

Index(['Name', 'Previous_Part', 'Participation1', 'Mini_Exam1', 'Mini_Exam2',
       'Participation2', 'Mini_Exam3', 'Final', 'Grade', 'ID'],
      dtype='object')

In [115]:
df_grades.index

RangeIndex(start=0, stop=7, step=1)

In [119]:
df_grades["Name"]

0     Jake
1      Joe
2    Susan
3      Sol
4    Chris
5    Tarik
6    Malik
Name: Name, dtype: object

In [121]:
df_grades.Name

0     Jake
1      Joe
2    Susan
3      Sol
4    Chris
5    Tarik
6    Malik
Name: Name, dtype: object

In [125]:
df_grades[['Name','Grade']]

    Name Grade
0   Jake     A
1    Joe     A
2  Susan    A-
3    Sol     A
4  Chris     A
5  Tarik     B
6  Malik     A

In [127]:
name=df_grades.Name

In [129]:
name[0]

'Jake'

In [131]:
name[1:4]

1      Joe
2    Susan
3      Sol
Name: Name, dtype: object

In [133]:
name[[1,2,3]]

1      Joe
2    Susan
3      Sol
Name: Name, dtype: object

In [135]:
first_name = df_grades.loc[0,'Name']
first_name

'Jake'

In [149]:
first_name1 = df_grades.iloc[0,0:3]
first_name1

Name              Jake
Previous_Part     32.0
Participation1       1
Name: 0, dtype: object

In [153]:
df_grades.Final.mean()

32.214285714285715

In [159]:
df_grades['Mini_Exam1'].max()

22.0

In [163]:
summary_df = df_grades.describe()
summary_df

,Previous_Part,Participation1,Mini_Exam1,Mini_Exam2,Participation2,Mini_Exam3,Final,ID
count,7.000000,7.0,7.000000,7.000000,7.0,7.000000,7.000000,7.00000
mean,31.071429,1.0,19.785714,17.857143,1.0,11.000000,32.214286,29111.00000
std,0.838082,0.0,1.074598,2.734262,0.0,2.217356,3.828154,41131.08167
min,30.000000,1.0,19.000000,13.000000,1.0,8.000000,24.000000,62.00000
25%,30.500000,1.0,19.000000,16.500000,1.0,9.500000,32.500000,4260.50000
50%,31.000000,1.0,19.500000,19.000000,1.0,10.500000,33.000000,7625.00000
75%,31.750000,1.0,20.000000,19.500000,1.0,12.750000,33.750000,48413.00000
max,32.000000,1.0,22.000000,21.000000,1.0,14.000000,36.000000,90743.00000

In [165]:
summary_df[['Final','Mini_Exam3']]
summary_df

,Previous_Part,Participation1,Mini_Exam1,Mini_Exam2,Participation2,Mini_Exam3,Final,ID
count,7.000000,7.0,7.000000,7.000000,7.0,7.000000,7.000000,7.00000
mean,31.071429,1.0,19.785714,17.857143,1.0,11.000000,32.214286,29111.00000
std,0.838082,0.0,1.074598,2.734262,0.0,2.217356,3.828154,41131.08167
min,30.000000,1.0,19.000000,13.000000,1.0,8.000000,24.000000,62.00000
25%,30.500000,1.0,19.000000,16.500000,1.0,9.500000,32.500000,4260.50000
50%,31.000000,1.0,19.500000,19.000000,1.0,10.500000,33.000000,7625.00000
75%,31.750000,1.0,20.000000,19.500000,1.0,12.750000,33.750000,48413.00000
max,32.000000,1.0,22.000000,21.000000,1.0,14.000000,36.000000,90743.00000

In [167]:
df_grades["Grade"].value_counts()

Grade
A     5
A-    1
B     1
Name: count, dtype: int64

In [171]:
counts = df_grades['Grade'].value_counts()
counts

Grade
A     5
A-    1
B     1
Name: count, dtype: int64

In [173]:
df_grades['Grade'].unique()

array(['A', 'A-', 'B'], dtype=object)

In [183]:
df_missing = pd.read_csv("Missing_Data.csv")
df_missing

,Name,Previous_Part,Participation1,Mini_Exam1,Mini_Exam2,Participation2,Mini_Exam3,Final,Grade,Temp
0,Jake,32.0,1,19.5,20,1,10.0,33.0,A,-1
1,Joe,NaN,1,20.0,16,1,14.0,32.0,A,23
2,Sol,31.0,1,22.0,13,1,13.0,34.0,A,34
3,Chris,30.0,-1,19.0,not available,1,12.5,33.5,A,72

In [185]:
df_missing.dtypes

Name               object
Previous_Part     float64
Participation1      int64
Mini_Exam1        float64
Mini_Exam2         object
Participation2      int64
Mini_Exam3        float64
Final             float64
Grade              object
Temp                int64
dtype: object

In [187]:
df_missing = pd.read_csv("Missing_Data.csv",na_values=["NaN","not available"])
df_missing

,Name,Previous_Part,Participation1,Mini_Exam1,Mini_Exam2,Participation2,Mini_Exam3,Final,Grade,Temp
0,Jake,32.0,1,19.5,20.0,1,10.0,33.0,A,-1
1,Joe,NaN,1,20.0,16.0,1,14.0,32.0,A,23
2,Sol,31.0,1,22.0,13.0,1,13.0,34.0,A,34
3,Chris,30.0,-1,19.0,NaN,1,12.5,33.5,A,72

In [193]:
df_missing = pd.read_csv("Missing_Data.csv",na_values={'Mini_Exam2' : "not available",\
"Participation1":-1})
df_missing

,Name,Previous_Part,Participation1,Mini_Exam1,Mini_Exam2,Participation2,Mini_Exam3,Final,Grade,Temp
0,Jake,32.0,1.0,19.5,20.0,1,10.0,33.0,A,-1
1,Joe,NaN,1.0,20.0,16.0,1,14.0,32.0,A,23
2,Sol,31.0,1.0,22.0,13.0,1,13.0,34.0,A,34
3,Chris,30.0,NaN,19.0,NaN,1,12.5,33.5,A,72